name: "IRes"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 480
input_dim: 480

input: "rois1"
input_dim: 1 # to be changed on-the-fly to num ROIs
input_dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
input_dim: 1
input_dim: 1

input: "label"
input_dim: 1
input_dim: 1
input_dim: 480
input_dim: 480

input: "label_p"
input_dim: 1
input_dim: 2
input_dim: 7
input_dim: 7

input: "v2_data"
input_dim: 1
input_dim: 3
input_dim: 480
input_dim: 480

input: "rois2"
input_dim: 1 # to be changed on-the-fly to num ROIs
input_dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
input_dim: 1
input_dim: 1

input: "v2_label"
input_dim: 1
input_dim: 1
input_dim: 480
input_dim: 480

input: "v2_label_p"
input_dim: 1
input_dim: 1
input_dim: 7
input_dim: 7

################################ image 1 ################################


layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    name: "0"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "conv1_bn"
  type: "BN"
  bottom: "conv1"
  top: "conv1_bn"
  param {
    name: "1"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "2"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "3"
  }
  param {
    name: "4"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1_bn"
  top: "conv1_bn"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_bn"
  top: "conv1_2"
  param {
    name: "5"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "conv1_2_bn"
  type: "BN"
  bottom: "conv1_2"
  top: "conv1_2_bn"
  param {
    name: "6"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "7"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "8"
  }
  param {
    name: "9"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_2_relu"
  type: "ReLU"
  bottom: "conv1_2_bn"
  top: "conv1_2_bn"
}
layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "conv1_2_bn"
  top: "conv1_3"
  param {
    name: "10"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "conv1_3_bn"
  type: "BN"
  bottom: "conv1_3"
  top: "conv1_3_bn"
  param {
    name: "11"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "12"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "13"
  }
  param {
    name: "14"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_3_relu"
  type: "ReLU"
  bottom: "conv1_3_bn"
  top: "conv1_3_bn"
}
layer {
  name: "conv1_pool_branch"
  type: "Pooling"
  bottom: "conv1_3_bn"
  top: "conv1_pool_branch"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "conv1_branch"
  type: "Convolution"
  bottom: "conv1_3_bn"
  top: "conv1_branch"
  param {
    name: "15"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "conv1_branch_bn"
  type: "BN"
  bottom: "conv1_branch"
  top: "conv1_branch_bn"
  param {
    name: "16"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "17"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "18"
  }
  param {
    name: "19"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_branch_relu"
  type: "ReLU"
  bottom: "conv1_branch_bn"
  top: "conv1_branch_bn"
}
layer {
  name: "conv1_concat"
  type: "Concat"
  bottom: "conv1_pool_branch"
  bottom: "conv1_branch_bn"
  top: "conv1_concat"
}
layer {
  name: "conv2_short_1x1"
  type: "Convolution"
  bottom: "conv1_concat"
  top: "conv2_short_1x1"
  param {
    name: "20"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "conv2_short_1x1_bn"
  type: "BN"
  bottom: "conv2_short_1x1"
  top: "conv2_short_1x1_bn"
  param {
    name: "21"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "22"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "23"
  }
  param {
    name: "24"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_short_1x1_relu"
  type: "ReLU"
  bottom: "conv2_short_1x1_bn"
  top: "conv2_short_1x1_bn"
}
layer {
  name: "conv2_short_3x3"
  type: "Convolution"
  bottom: "conv2_short_1x1_bn"
  top: "conv2_short_3x3"
  param {
    name: "25"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "conv2_short_3x3_bn"
  type: "BN"
  bottom: "conv2_short_3x3"
  top: "conv2_short_3x3_bn"
  param {
    name: "26"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "27"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "28"
  }
  param {
    name: "29"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_short_3x3_relu"
  type: "ReLU"
  bottom: "conv2_short_3x3_bn"
  top: "conv2_short_3x3_bn"
}
layer {
  name: "conv2_long_1x1"
  type: "Convolution"
  bottom: "conv1_concat"
  top: "conv2_long_1x1"
  param {
    name: "30"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "conv2_long_1x1_bn"
  type: "BN"
  bottom: "conv2_long_1x1"
  top: "conv2_long_1x1_bn"
  param {
    name: "31"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "32"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "33"
  }
  param {
    name: "34"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_long_1x1_relu"
  type: "ReLU"
  bottom: "conv2_long_1x1_bn"
  top: "conv2_long_1x1_bn"
}
layer {
  name: "conv2_long_7x1"
  type: "Convolution"
  bottom: "conv2_long_1x1_bn"
  top: "conv2_long_7x1"
  param {
    name: "35"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "conv2_long_7x1_bn"
  type: "BN"
  bottom: "conv2_long_7x1"
  top: "conv2_long_7x1_bn"
  param {
    name: "36"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "37"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "38"
  }
  param {
    name: "39"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_long_7x1_relu"
  type: "ReLU"
  bottom: "conv2_long_7x1_bn"
  top: "conv2_long_7x1_bn"
}
layer {
  name: "conv2_long_1x7"
  type: "Convolution"
  bottom: "conv2_long_7x1_bn"
  top: "conv2_long_1x7"
  param {
    name: "40"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "conv2_long_1x7_bn"
  type: "BN"
  bottom: "conv2_long_1x7"
  top: "conv2_long_1x7_bn"
  param {
    name: "41"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "42"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "43"
  }
  param {
    name: "44"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_long_1x7_relu"
  type: "ReLU"
  bottom: "conv2_long_1x7_bn"
  top: "conv2_long_1x7_bn"
}
layer {
  name: "conv2_long_3x3"
  type: "Convolution"
  bottom: "conv2_long_1x7_bn"
  top: "conv2_long_3x3"
  param {
    name: "45"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "conv2_long_3x3_bn"
  type: "BN"
  bottom: "conv2_long_3x3"
  top: "conv2_long_3x3_bn"
  param {
    name: "46"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "47"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "48"
  }
  param {
    name: "49"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_long_3x3_relu"
  type: "ReLU"
  bottom: "conv2_long_3x3_bn"
  top: "conv2_long_3x3_bn"
}
layer {
  name: "conv2_concat"
  type: "Concat"
  bottom: "conv2_short_3x3_bn"
  bottom: "conv2_long_3x3_bn"
  top: "conv2_concat"
}
layer {
  name: "conv2_pool_branch"
  type: "Pooling"
  bottom: "conv2_concat"
  top: "conv2_pool_branch"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "conv2_branch"
  type: "Convolution"
  bottom: "conv2_concat"
  top: "conv2_branch"
  param {
    name: "50"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "conv2_branch_bn"
  type: "BN"
  bottom: "conv2_branch"
  top: "conv2_branch_bn"
  param {
    name: "51"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "52"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "53"
  }
  param {
    name: "54"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_branch_relu"
  type: "ReLU"
  bottom: "conv2_branch_bn"
  top: "conv2_branch_bn"
}
layer {
  name: "stem_concat"
  type: "Concat"
  bottom: "conv2_pool_branch"
  bottom: "conv2_branch_bn"
  top: "stem_concat"
}
layer {
  name: "inception_resnet_a_1_path1_1x1"
  type: "Convolution"
  bottom: "stem_concat"
  top: "inception_resnet_a_1_path1_1x1"
  param {
    name: "55"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_1_path1_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_1_path1_1x1"
  top: "inception_resnet_a_1_path1_1x1_bn"
  param {
    name: "56"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "57"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "58"
  }
  param {
    name: "59"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_1_path1_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_1_path1_1x1_bn"
  top: "inception_resnet_a_1_path1_1x1_bn"
}
layer {
  name: "inception_resnet_a_1_path1_3x3_1"
  type: "Convolution"
  bottom: "inception_resnet_a_1_path1_1x1_bn"
  top: "inception_resnet_a_1_path1_3x3_1"
  param {
    name: "60"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_1_path1_3x3_1_bn"
  type: "BN"
  bottom: "inception_resnet_a_1_path1_3x3_1"
  top: "inception_resnet_a_1_path1_3x3_1_bn"
  param {
    name: "61"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "62"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "63"
  }
  param {
    name: "64"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_1_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_1_path1_3x3_1_bn"
  top: "inception_resnet_a_1_path1_3x3_1_bn"
}
layer {
  name: "inception_resnet_a_1_path1_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_a_1_path1_3x3_1_bn"
  top: "inception_resnet_a_1_path1_3x3_2"
  param {
    name: "65"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_1_path1_3x3_2_bn"
  type: "BN"
  bottom: "inception_resnet_a_1_path1_3x3_2"
  top: "inception_resnet_a_1_path1_3x3_2_bn"
  param {
    name: "66"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "67"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "68"
  }
  param {
    name: "69"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_1_path1_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_1_path1_3x3_2_bn"
  top: "inception_resnet_a_1_path1_3x3_2_bn"
}
layer {
  name: "inception_resnet_a_1_path2_1x1"
  type: "Convolution"
  bottom: "stem_concat"
  top: "inception_resnet_a_1_path2_1x1"
  param {
    name: "70"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_1_path2_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_1_path2_1x1"
  top: "inception_resnet_a_1_path2_1x1_bn"
  param {
    name: "71"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "72"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "73"
  }
  param {
    name: "74"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_1_path2_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_1_path2_1x1_bn"
  top: "inception_resnet_a_1_path2_1x1_bn"
}
layer {
  name: "inception_resnet_a_1_path2_3x3"
  type: "Convolution"
  bottom: "inception_resnet_a_1_path2_1x1_bn"
  top: "inception_resnet_a_1_path2_3x3"
  param {
    name: "75"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_1_path2_3x3_bn"
  type: "BN"
  bottom: "inception_resnet_a_1_path2_3x3"
  top: "inception_resnet_a_1_path2_3x3_bn"
  param {
    name: "76"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "77"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "78"
  }
  param {
    name: "79"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_1_path2_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_1_path2_3x3_bn"
  top: "inception_resnet_a_1_path2_3x3_bn"
}
layer {
  name: "inception_resnet_a_1_path3_1x1"
  type: "Convolution"
  bottom: "stem_concat"
  top: "inception_resnet_a_1_path3_1x1"
  param {
    name: "80"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_1_path3_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_1_path3_1x1"
  top: "inception_resnet_a_1_path3_1x1_bn"
  param {
    name: "81"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "82"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "83"
  }
  param {
    name: "84"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_1_path3_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_1_path3_1x1_bn"
  top: "inception_resnet_a_1_path3_1x1_bn"
}
layer {
  name: "inception_resnet_a_1_concat"
  type: "Concat"
  bottom: "inception_resnet_a_1_path1_3x3_2_bn"
  bottom: "inception_resnet_a_1_path2_3x3_bn"
  bottom: "inception_resnet_a_1_path3_1x1_bn"
  top: "inception_resnet_a_1_concat"
}
layer {
  name: "inception_resnet_a_1_conv_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_1_concat"
  top: "inception_resnet_a_1_conv_1x1"
  param {
    name: "85"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_1_conv_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_1_conv_1x1"
  top: "inception_resnet_a_1_conv_1x1_bn"
  param {
    name: "86"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "87"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "88"
  }
  param {
    name: "89"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_1_elt"
  type: "Eltwise"
  bottom: "stem_concat"
  bottom: "inception_resnet_a_1_conv_1x1_bn"
  top: "inception_resnet_a_1_elt"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "inception_resnet_a_1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_1_elt"
  top: "inception_resnet_a_1_elt"
}
layer {
  name: "inception_resnet_a_2_path1_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_1_elt"
  top: "inception_resnet_a_2_path1_1x1"
  param {
    name: "90"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_2_path1_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_2_path1_1x1"
  top: "inception_resnet_a_2_path1_1x1_bn"
  param {
    name: "91"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "92"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "93"
  }
  param {
    name: "94"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_2_path1_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_2_path1_1x1_bn"
  top: "inception_resnet_a_2_path1_1x1_bn"
}
layer {
  name: "inception_resnet_a_2_path1_3x3_1"
  type: "Convolution"
  bottom: "inception_resnet_a_2_path1_1x1_bn"
  top: "inception_resnet_a_2_path1_3x3_1"
  param {
    name: "95"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_2_path1_3x3_1_bn"
  type: "BN"
  bottom: "inception_resnet_a_2_path1_3x3_1"
  top: "inception_resnet_a_2_path1_3x3_1_bn"
  param {
    name: "96"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "97"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "98"
  }
  param {
    name: "99"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_2_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_2_path1_3x3_1_bn"
  top: "inception_resnet_a_2_path1_3x3_1_bn"
}
layer {
  name: "inception_resnet_a_2_path1_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_a_2_path1_3x3_1_bn"
  top: "inception_resnet_a_2_path1_3x3_2"
  param {
    name: "100"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_2_path1_3x3_2_bn"
  type: "BN"
  bottom: "inception_resnet_a_2_path1_3x3_2"
  top: "inception_resnet_a_2_path1_3x3_2_bn"
  param {
    name: "101"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "102"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "103"
  }
  param {
    name: "104"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_2_path1_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_2_path1_3x3_2_bn"
  top: "inception_resnet_a_2_path1_3x3_2_bn"
}
layer {
  name: "inception_resnet_a_2_path2_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_1_elt"
  top: "inception_resnet_a_2_path2_1x1"
  param {
    name: "105"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_2_path2_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_2_path2_1x1"
  top: "inception_resnet_a_2_path2_1x1_bn"
  param {
    name: "106"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "107"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "108"
  }
  param {
    name: "109"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_2_path2_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_2_path2_1x1_bn"
  top: "inception_resnet_a_2_path2_1x1_bn"
}
layer {
  name: "inception_resnet_a_2_path2_3x3"
  type: "Convolution"
  bottom: "inception_resnet_a_2_path2_1x1_bn"
  top: "inception_resnet_a_2_path2_3x3"
  param {
    name: "110"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_2_path2_3x3_bn"
  type: "BN"
  bottom: "inception_resnet_a_2_path2_3x3"
  top: "inception_resnet_a_2_path2_3x3_bn"
  param {
    name: "111"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "112"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "113"
  }
  param {
    name: "114"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_2_path2_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_2_path2_3x3_bn"
  top: "inception_resnet_a_2_path2_3x3_bn"
}
layer {
  name: "inception_resnet_a_2_path3_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_1_elt"
  top: "inception_resnet_a_2_path3_1x1"
  param {
    name: "115"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_2_path3_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_2_path3_1x1"
  top: "inception_resnet_a_2_path3_1x1_bn"
  param {
    name: "116"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "117"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "118"
  }
  param {
    name: "119"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_2_path3_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_2_path3_1x1_bn"
  top: "inception_resnet_a_2_path3_1x1_bn"
}
layer {
  name: "inception_resnet_a_2_concat"
  type: "Concat"
  bottom: "inception_resnet_a_2_path1_3x3_2_bn"
  bottom: "inception_resnet_a_2_path2_3x3_bn"
  bottom: "inception_resnet_a_2_path3_1x1_bn"
  top: "inception_resnet_a_2_concat"
}
layer {
  name: "inception_resnet_a_2_conv_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_2_concat"
  top: "inception_resnet_a_2_conv_1x1"
  param {
    name: "120"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_2_conv_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_2_conv_1x1"
  top: "inception_resnet_a_2_conv_1x1_bn"
  param {
    name: "121"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "122"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "123"
  }
  param {
    name: "124"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_2_elt"
  type: "Eltwise"
  bottom: "inception_resnet_a_1_elt"
  bottom: "inception_resnet_a_2_conv_1x1_bn"
  top: "inception_resnet_a_2_elt"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "inception_resnet_a_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_2_elt"
  top: "inception_resnet_a_2_elt"
}
layer {
  name: "inception_resnet_a_3_path1_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_2_elt"
  top: "inception_resnet_a_3_path1_1x1"
  param {
    name: "125"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_3_path1_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_3_path1_1x1"
  top: "inception_resnet_a_3_path1_1x1_bn"
  param {
    name: "126"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "127"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "128"
  }
  param {
    name: "129"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_3_path1_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_3_path1_1x1_bn"
  top: "inception_resnet_a_3_path1_1x1_bn"
}
layer {
  name: "inception_resnet_a_3_path1_3x3_1"
  type: "Convolution"
  bottom: "inception_resnet_a_3_path1_1x1_bn"
  top: "inception_resnet_a_3_path1_3x3_1"
  param {
    name: "130"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_3_path1_3x3_1_bn"
  type: "BN"
  bottom: "inception_resnet_a_3_path1_3x3_1"
  top: "inception_resnet_a_3_path1_3x3_1_bn"
  param {
    name: "131"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "132"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "133"
  }
  param {
    name: "134"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_3_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_3_path1_3x3_1_bn"
  top: "inception_resnet_a_3_path1_3x3_1_bn"
}
layer {
  name: "inception_resnet_a_3_path1_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_a_3_path1_3x3_1_bn"
  top: "inception_resnet_a_3_path1_3x3_2"
  param {
    name: "135"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_3_path1_3x3_2_bn"
  type: "BN"
  bottom: "inception_resnet_a_3_path1_3x3_2"
  top: "inception_resnet_a_3_path1_3x3_2_bn"
  param {
    name: "136"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "137"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "138"
  }
  param {
    name: "139"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_3_path1_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_3_path1_3x3_2_bn"
  top: "inception_resnet_a_3_path1_3x3_2_bn"
}
layer {
  name: "inception_resnet_a_3_path2_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_2_elt"
  top: "inception_resnet_a_3_path2_1x1"
  param {
    name: "140"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_3_path2_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_3_path2_1x1"
  top: "inception_resnet_a_3_path2_1x1_bn"
  param {
    name: "141"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "142"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "143"
  }
  param {
    name: "144"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_3_path2_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_3_path2_1x1_bn"
  top: "inception_resnet_a_3_path2_1x1_bn"
}
layer {
  name: "inception_resnet_a_3_path2_3x3"
  type: "Convolution"
  bottom: "inception_resnet_a_3_path2_1x1_bn"
  top: "inception_resnet_a_3_path2_3x3"
  param {
    name: "145"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_3_path2_3x3_bn"
  type: "BN"
  bottom: "inception_resnet_a_3_path2_3x3"
  top: "inception_resnet_a_3_path2_3x3_bn"
  param {
    name: "146"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "147"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "148"
  }
  param {
    name: "149"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_3_path2_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_3_path2_3x3_bn"
  top: "inception_resnet_a_3_path2_3x3_bn"
}
layer {
  name: "inception_resnet_a_3_path3_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_2_elt"
  top: "inception_resnet_a_3_path3_1x1"
  param {
    name: "150"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_3_path3_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_3_path3_1x1"
  top: "inception_resnet_a_3_path3_1x1_bn"
  param {
    name: "151"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "152"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "153"
  }
  param {
    name: "154"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_3_path3_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_3_path3_1x1_bn"
  top: "inception_resnet_a_3_path3_1x1_bn"
}
layer {
  name: "inception_resnet_a_3_concat"
  type: "Concat"
  bottom: "inception_resnet_a_3_path1_3x3_2_bn"
  bottom: "inception_resnet_a_3_path2_3x3_bn"
  bottom: "inception_resnet_a_3_path3_1x1_bn"
  top: "inception_resnet_a_3_concat"
}
layer {
  name: "inception_resnet_a_3_conv_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_3_concat"
  top: "inception_resnet_a_3_conv_1x1"
  param {
    name: "155"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_3_conv_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_3_conv_1x1"
  top: "inception_resnet_a_3_conv_1x1_bn"
  param {
    name: "156"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "157"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "158"
  }
  param {
    name: "159"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_3_elt"
  type: "Eltwise"
  bottom: "inception_resnet_a_2_elt"
  bottom: "inception_resnet_a_3_conv_1x1_bn"
  top: "inception_resnet_a_3_elt"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "inception_resnet_a_3_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_3_elt"
  top: "inception_resnet_a_3_elt"
}
layer {
  name: "inception_resnet_a_4_path1_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_3_elt"
  top: "inception_resnet_a_4_path1_1x1"
  param {
    name: "160"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_4_path1_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_4_path1_1x1"
  top: "inception_resnet_a_4_path1_1x1_bn"
  param {
    name: "161"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "162"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "163"
  }
  param {
    name: "164"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_4_path1_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_4_path1_1x1_bn"
  top: "inception_resnet_a_4_path1_1x1_bn"
}
layer {
  name: "inception_resnet_a_4_path1_3x3_1"
  type: "Convolution"
  bottom: "inception_resnet_a_4_path1_1x1_bn"
  top: "inception_resnet_a_4_path1_3x3_1"
  param {
    name: "165"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_4_path1_3x3_1_bn"
  type: "BN"
  bottom: "inception_resnet_a_4_path1_3x3_1"
  top: "inception_resnet_a_4_path1_3x3_1_bn"
  param {
    name: "166"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "167"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "168"
  }
  param {
    name: "169"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_4_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_4_path1_3x3_1_bn"
  top: "inception_resnet_a_4_path1_3x3_1_bn"
}
layer {
  name: "inception_resnet_a_4_path1_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_a_4_path1_3x3_1_bn"
  top: "inception_resnet_a_4_path1_3x3_2"
  param {
    name: "170"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_4_path1_3x3_2_bn"
  type: "BN"
  bottom: "inception_resnet_a_4_path1_3x3_2"
  top: "inception_resnet_a_4_path1_3x3_2_bn"
  param {
    name: "171"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "172"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "173"
  }
  param {
    name: "174"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_4_path1_3x3_2_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_4_path1_3x3_2_bn"
  top: "inception_resnet_a_4_path1_3x3_2_bn"
}
layer {
  name: "inception_resnet_a_4_path2_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_3_elt"
  top: "inception_resnet_a_4_path2_1x1"
  param {
    name: "175"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_4_path2_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_4_path2_1x1"
  top: "inception_resnet_a_4_path2_1x1_bn"
  param {
    name: "176"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "177"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "178"
  }
  param {
    name: "179"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_4_path2_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_4_path2_1x1_bn"
  top: "inception_resnet_a_4_path2_1x1_bn"
}
layer {
  name: "inception_resnet_a_4_path2_3x3"
  type: "Convolution"
  bottom: "inception_resnet_a_4_path2_1x1_bn"
  top: "inception_resnet_a_4_path2_3x3"
  param {
    name: "180"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_4_path2_3x3_bn"
  type: "BN"
  bottom: "inception_resnet_a_4_path2_3x3"
  top: "inception_resnet_a_4_path2_3x3_bn"
  param {
    name: "181"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "182"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "183"
  }
  param {
    name: "184"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_4_path2_3x3_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_4_path2_3x3_bn"
  top: "inception_resnet_a_4_path2_3x3_bn"
}
layer {
  name: "inception_resnet_a_4_path3_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_3_elt"
  top: "inception_resnet_a_4_path3_1x1"
  param {
    name: "185"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_4_path3_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_4_path3_1x1"
  top: "inception_resnet_a_4_path3_1x1_bn"
  param {
    name: "186"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "187"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "188"
  }
  param {
    name: "189"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_4_path3_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_4_path3_1x1_bn"
  top: "inception_resnet_a_4_path3_1x1_bn"
}
layer {
  name: "inception_resnet_a_4_concat"
  type: "Concat"
  bottom: "inception_resnet_a_4_path1_3x3_2_bn"
  bottom: "inception_resnet_a_4_path2_3x3_bn"
  bottom: "inception_resnet_a_4_path3_1x1_bn"
  top: "inception_resnet_a_4_concat"
}
layer {
  name: "inception_resnet_a_4_conv_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_4_concat"
  top: "inception_resnet_a_4_conv_1x1"
  param {
    name: "190"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_4_conv_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_4_conv_1x1"
  top: "inception_resnet_a_4_conv_1x1_bn"
  param {
    name: "191"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "192"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "193"
  }
  param {
    name: "194"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_4_elt"
  type: "Eltwise"
  bottom: "inception_resnet_a_3_elt"
  bottom: "inception_resnet_a_4_conv_1x1_bn"
  top: "inception_resnet_a_4_elt"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "inception_resnet_a_4_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_4_elt"
  top: "inception_resnet_a_4_elt"
}
layer {
  name: "inception_resnet_a_5_path1_1x1"
  type: "Convolution"
  bottom: "inception_resnet_a_4_elt"
  top: "inception_resnet_a_5_path1_1x1"
  param {
    name: "195"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_5_path1_1x1_bn"
  type: "BN"
  bottom: "inception_resnet_a_5_path1_1x1"
  top: "inception_resnet_a_5_path1_1x1_bn"
  param {
    name: "196"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "197"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "198"
  }
  param {
    name: "199"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_5_path1_1x1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_5_path1_1x1_bn"
  top: "inception_resnet_a_5_path1_1x1_bn"
}
layer {
  name: "inception_resnet_a_5_path1_3x3_1"
  type: "Convolution"
  bottom: "inception_resnet_a_5_path1_1x1_bn"
  top: "inception_resnet_a_5_path1_3x3_1"
  param {
    name: "200"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_5_path1_3x3_1_bn"
  type: "BN"
  bottom: "inception_resnet_a_5_path1_3x3_1"
  top: "inception_resnet_a_5_path1_3x3_1_bn"
  param {
    name: "201"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "202"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "203"
  }
  param {
    name: "204"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_resnet_a_5_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "inception_resnet_a_5_path1_3x3_1_bn"
  top: "inception_resnet_a_5_path1_3x3_1_bn"
}
layer {
  name: "inception_resnet_a_5_path1_3x3_2"
  type: "Convolution"
  bottom: "inception_resnet_a_5_path1_3x3_1_bn"
  top: "inception_resnet_a_5_path1_3x3_2"
  param {
    name: "205"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "inception_resnet_a_5_path1_3x3_2_bn"
  type: "BN"
  bottom: "inception_resnet_a_5_path1_3x3_2"
  top: "inception_resnet_a_5_path1_3x3_2_bn"
  param {
    name: "206"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "207"
    lr_mult: 1.0
