################################ image 1 ################################


layer {
  name: "v2_conv1"
  type: "Convolution"
  bottom: "v2_data1"
  top: "v2_conv1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "v2_conv1_bn"
  type: "BN"
  bottom: "v2_conv1"
  top: "v2_conv1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv1_relu"
  type: "ReLU"
  bottom: "v2_conv1_bn"
  top: "v2_conv1_bn"
}
layer {
  name: "v2_conv1_2"
  type: "Convolution"
  bottom: "v2_conv1_bn"
  top: "v2_conv1_2"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_conv1_2_bn"
  type: "BN"
  bottom: "v2_conv1_2"
  top: "v2_conv1_2_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv1_2_relu"
  type: "ReLU"
  bottom: "v2_conv1_2_bn"
  top: "v2_conv1_2_bn"
}
layer {
  name: "v2_conv1_3"
  type: "Convolution"
  bottom: "v2_conv1_2_bn"
  top: "v2_conv1_3"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_conv1_3_bn"
  type: "BN"
  bottom: "v2_conv1_3"
  top: "v2_conv1_3_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv1_3_relu"
  type: "ReLU"
  bottom: "v2_conv1_3_bn"
  top: "v2_conv1_3_bn"
}
layer {
  name: "v2_conv1_pool_branch"
  type: "Pooling"
  bottom: "v2_conv1_3_bn"
  top: "v2_conv1_pool_branch"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "v2_conv1_branch"
  type: "Convolution"
  bottom: "v2_conv1_3_bn"
  top: "v2_conv1_branch"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "v2_conv1_branch_bn"
  type: "BN"
  bottom: "v2_conv1_branch"
  top: "v2_conv1_branch_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv1_branch_relu"
  type: "ReLU"
  bottom: "v2_conv1_branch_bn"
  top: "v2_conv1_branch_bn"
}
layer {
  name: "v2_conv1_concat"
  type: "Concat"
  bottom: "v2_conv1_pool_branch"
  bottom: "v2_conv1_branch_bn"
  top: "v2_conv1_concat"
}
layer {
  name: "v2_conv2_short_1x1"
  type: "Convolution"
  bottom: "v2_conv1_concat"
  top: "v2_conv2_short_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_conv2_short_1x1_bn"
  type: "BN"
  bottom: "v2_conv2_short_1x1"
  top: "v2_conv2_short_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv2_short_1x1_relu"
  type: "ReLU"
  bottom: "v2_conv2_short_1x1_bn"
  top: "v2_conv2_short_1x1_bn"
}
layer {
  name: "v2_conv2_short_3x3"
  type: "Convolution"
  bottom: "v2_conv2_short_1x1_bn"
  top: "v2_conv2_short_3x3"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_conv2_short_3x3_bn"
  type: "BN"
  bottom: "v2_conv2_short_3x3"
  top: "v2_conv2_short_3x3_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv2_short_3x3_relu"
  type: "ReLU"
  bottom: "v2_conv2_short_3x3_bn"
  top: "v2_conv2_short_3x3_bn"
}
layer {
  name: "v2_conv2_long_1x1"
  type: "Convolution"
  bottom: "v2_conv1_concat"
  top: "v2_conv2_long_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_conv2_long_1x1_bn"
  type: "BN"
  bottom: "v2_conv2_long_1x1"
  top: "v2_conv2_long_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv2_long_1x1_relu"
  type: "ReLU"
  bottom: "v2_conv2_long_1x1_bn"
  top: "v2_conv2_long_1x1_bn"
}
layer {
  name: "v2_conv2_long_7x1"
  type: "Convolution"
  bottom: "v2_conv2_long_1x1_bn"
  top: "v2_conv2_long_7x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_conv2_long_7x1_bn"
  type: "BN"
  bottom: "v2_conv2_long_7x1"
  top: "v2_conv2_long_7x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv2_long_7x1_relu"
  type: "ReLU"
  bottom: "v2_conv2_long_7x1_bn"
  top: "v2_conv2_long_7x1_bn"
}
layer {
  name: "v2_conv2_long_1x7"
  type: "Convolution"
  bottom: "v2_conv2_long_7x1_bn"
  top: "v2_conv2_long_1x7"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_conv2_long_1x7_bn"
  type: "BN"
  bottom: "v2_conv2_long_1x7"
  top: "v2_conv2_long_1x7_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv2_long_1x7_relu"
  type: "ReLU"
  bottom: "v2_conv2_long_1x7_bn"
  top: "v2_conv2_long_1x7_bn"
}
layer {
  name: "v2_conv2_long_3x3"
  type: "Convolution"
  bottom: "v2_conv2_long_1x7_bn"
  top: "v2_conv2_long_3x3"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_conv2_long_3x3_bn"
  type: "BN"
  bottom: "v2_conv2_long_3x3"
  top: "v2_conv2_long_3x3_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv2_long_3x3_relu"
  type: "ReLU"
  bottom: "v2_conv2_long_3x3_bn"
  top: "v2_conv2_long_3x3_bn"
}
layer {
  name: "v2_conv2_concat"
  type: "Concat"
  bottom: "v2_conv2_short_3x3_bn"
  bottom: "v2_conv2_long_3x3_bn"
  top: "v2_conv2_concat"
}
layer {
  name: "v2_conv2_pool_branch"
  type: "Pooling"
  bottom: "v2_conv2_concat"
  top: "v2_conv2_pool_branch"
  pooling_param {
    pool: MAX
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "v2_conv2_branch"
  type: "Convolution"
  bottom: "v2_conv2_concat"
  top: "v2_conv2_branch"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
  }
}
layer {
  name: "v2_conv2_branch_bn"
  type: "BN"
  bottom: "v2_conv2_branch"
  top: "v2_conv2_branch_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_conv2_branch_relu"
  type: "ReLU"
  bottom: "v2_conv2_branch_bn"
  top: "v2_conv2_branch_bn"
}
layer {
  name: "v2_stem_concat"
  type: "Concat"
  bottom: "v2_conv2_pool_branch"
  bottom: "v2_conv2_branch_bn"
  top: "v2_stem_concat"
}
layer {
  name: "v2_inception_resnet_a_1_path1_1x1"
  type: "Convolution"
  bottom: "v2_stem_concat"
  top: "v2_inception_resnet_a_1_path1_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_1_path1_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_1_path1_1x1"
  top: "v2_inception_resnet_a_1_path1_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_1_path1_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_1_path1_1x1_bn"
  top: "v2_inception_resnet_a_1_path1_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_1_path1_3x3_1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_1_path1_1x1_bn"
  top: "v2_inception_resnet_a_1_path1_3x3_1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_1_path1_3x3_1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_1_path1_3x3_1"
  top: "v2_inception_resnet_a_1_path1_3x3_1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_1_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_1_path1_3x3_1_bn"
  top: "v2_inception_resnet_a_1_path1_3x3_1_bn"
}
layer {
  name: "v2_inception_resnet_a_1_path1_3x3_2"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_1_path1_3x3_1_bn"
  top: "v2_inception_resnet_a_1_path1_3x3_2"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_1_path1_3x3_2_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_1_path1_3x3_2"
  top: "v2_inception_resnet_a_1_path1_3x3_2_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_1_path1_3x3_2_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_1_path1_3x3_2_bn"
  top: "v2_inception_resnet_a_1_path1_3x3_2_bn"
}
layer {
  name: "v2_inception_resnet_a_1_path2_1x1"
  type: "Convolution"
  bottom: "v2_stem_concat"
  top: "v2_inception_resnet_a_1_path2_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_1_path2_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_1_path2_1x1"
  top: "v2_inception_resnet_a_1_path2_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_1_path2_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_1_path2_1x1_bn"
  top: "v2_inception_resnet_a_1_path2_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_1_path2_3x3"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_1_path2_1x1_bn"
  top: "v2_inception_resnet_a_1_path2_3x3"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_1_path2_3x3_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_1_path2_3x3"
  top: "v2_inception_resnet_a_1_path2_3x3_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_1_path2_3x3_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_1_path2_3x3_bn"
  top: "v2_inception_resnet_a_1_path2_3x3_bn"
}
layer {
  name: "v2_inception_resnet_a_1_path3_1x1"
  type: "Convolution"
  bottom: "v2_stem_concat"
  top: "v2_inception_resnet_a_1_path3_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_1_path3_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_1_path3_1x1"
  top: "v2_inception_resnet_a_1_path3_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_1_path3_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_1_path3_1x1_bn"
  top: "v2_inception_resnet_a_1_path3_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_1_concat"
  type: "Concat"
  bottom: "v2_inception_resnet_a_1_path1_3x3_2_bn"
  bottom: "v2_inception_resnet_a_1_path2_3x3_bn"
  bottom: "v2_inception_resnet_a_1_path3_1x1_bn"
  top: "v2_inception_resnet_a_1_concat"
}
layer {
  name: "v2_inception_resnet_a_1_conv_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_1_concat"
  top: "v2_inception_resnet_a_1_conv_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_1_conv_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_1_conv_1x1"
  top: "v2_inception_resnet_a_1_conv_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_1_elt"
  type: "Eltwise"
  bottom: "v2_stem_concat"
  bottom: "v2_inception_resnet_a_1_conv_1x1_bn"
  top: "v2_inception_resnet_a_1_elt"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "v2_inception_resnet_a_1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_1_elt"
  top: "v2_inception_resnet_a_1_elt"
}
layer {
  name: "v2_inception_resnet_a_2_path1_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_1_elt"
  top: "v2_inception_resnet_a_2_path1_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_2_path1_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_2_path1_1x1"
  top: "v2_inception_resnet_a_2_path1_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_2_path1_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_2_path1_1x1_bn"
  top: "v2_inception_resnet_a_2_path1_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_2_path1_3x3_1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_2_path1_1x1_bn"
  top: "v2_inception_resnet_a_2_path1_3x3_1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_2_path1_3x3_1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_2_path1_3x3_1"
  top: "v2_inception_resnet_a_2_path1_3x3_1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_2_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_2_path1_3x3_1_bn"
  top: "v2_inception_resnet_a_2_path1_3x3_1_bn"
}
layer {
  name: "v2_inception_resnet_a_2_path1_3x3_2"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_2_path1_3x3_1_bn"
  top: "v2_inception_resnet_a_2_path1_3x3_2"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_2_path1_3x3_2_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_2_path1_3x3_2"
  top: "v2_inception_resnet_a_2_path1_3x3_2_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_2_path1_3x3_2_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_2_path1_3x3_2_bn"
  top: "v2_inception_resnet_a_2_path1_3x3_2_bn"
}
layer {
  name: "v2_inception_resnet_a_2_path2_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_1_elt"
  top: "v2_inception_resnet_a_2_path2_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_2_path2_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_2_path2_1x1"
  top: "v2_inception_resnet_a_2_path2_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_2_path2_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_2_path2_1x1_bn"
  top: "v2_inception_resnet_a_2_path2_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_2_path2_3x3"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_2_path2_1x1_bn"
  top: "v2_inception_resnet_a_2_path2_3x3"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_2_path2_3x3_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_2_path2_3x3"
  top: "v2_inception_resnet_a_2_path2_3x3_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_2_path2_3x3_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_2_path2_3x3_bn"
  top: "v2_inception_resnet_a_2_path2_3x3_bn"
}
layer {
  name: "v2_inception_resnet_a_2_path3_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_1_elt"
  top: "v2_inception_resnet_a_2_path3_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_2_path3_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_2_path3_1x1"
  top: "v2_inception_resnet_a_2_path3_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_2_path3_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_2_path3_1x1_bn"
  top: "v2_inception_resnet_a_2_path3_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_2_concat"
  type: "Concat"
  bottom: "v2_inception_resnet_a_2_path1_3x3_2_bn"
  bottom: "v2_inception_resnet_a_2_path2_3x3_bn"
  bottom: "v2_inception_resnet_a_2_path3_1x1_bn"
  top: "v2_inception_resnet_a_2_concat"
}
layer {
  name: "v2_inception_resnet_a_2_conv_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_2_concat"
  top: "v2_inception_resnet_a_2_conv_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_2_conv_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_2_conv_1x1"
  top: "v2_inception_resnet_a_2_conv_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_2_elt"
  type: "Eltwise"
  bottom: "v2_inception_resnet_a_1_elt"
  bottom: "v2_inception_resnet_a_2_conv_1x1_bn"
  top: "v2_inception_resnet_a_2_elt"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "v2_inception_resnet_a_2_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_2_elt"
  top: "v2_inception_resnet_a_2_elt"
}
layer {
  name: "v2_inception_resnet_a_3_path1_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_2_elt"
  top: "v2_inception_resnet_a_3_path1_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_3_path1_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_3_path1_1x1"
  top: "v2_inception_resnet_a_3_path1_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_3_path1_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_3_path1_1x1_bn"
  top: "v2_inception_resnet_a_3_path1_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_3_path1_3x3_1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_3_path1_1x1_bn"
  top: "v2_inception_resnet_a_3_path1_3x3_1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_3_path1_3x3_1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_3_path1_3x3_1"
  top: "v2_inception_resnet_a_3_path1_3x3_1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_3_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_3_path1_3x3_1_bn"
  top: "v2_inception_resnet_a_3_path1_3x3_1_bn"
}
layer {
  name: "v2_inception_resnet_a_3_path1_3x3_2"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_3_path1_3x3_1_bn"
  top: "v2_inception_resnet_a_3_path1_3x3_2"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_3_path1_3x3_2_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_3_path1_3x3_2"
  top: "v2_inception_resnet_a_3_path1_3x3_2_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_3_path1_3x3_2_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_3_path1_3x3_2_bn"
  top: "v2_inception_resnet_a_3_path1_3x3_2_bn"
}
layer {
  name: "v2_inception_resnet_a_3_path2_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_2_elt"
  top: "v2_inception_resnet_a_3_path2_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_3_path2_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_3_path2_1x1"
  top: "v2_inception_resnet_a_3_path2_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_3_path2_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_3_path2_1x1_bn"
  top: "v2_inception_resnet_a_3_path2_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_3_path2_3x3"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_3_path2_1x1_bn"
  top: "v2_inception_resnet_a_3_path2_3x3"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_3_path2_3x3_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_3_path2_3x3"
  top: "v2_inception_resnet_a_3_path2_3x3_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_3_path2_3x3_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_3_path2_3x3_bn"
  top: "v2_inception_resnet_a_3_path2_3x3_bn"
}
layer {
  name: "v2_inception_resnet_a_3_path3_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_2_elt"
  top: "v2_inception_resnet_a_3_path3_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_3_path3_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_3_path3_1x1"
  top: "v2_inception_resnet_a_3_path3_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_3_path3_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_3_path3_1x1_bn"
  top: "v2_inception_resnet_a_3_path3_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_3_concat"
  type: "Concat"
  bottom: "v2_inception_resnet_a_3_path1_3x3_2_bn"
  bottom: "v2_inception_resnet_a_3_path2_3x3_bn"
  bottom: "v2_inception_resnet_a_3_path3_1x1_bn"
  top: "v2_inception_resnet_a_3_concat"
}
layer {
  name: "v2_inception_resnet_a_3_conv_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_3_concat"
  top: "v2_inception_resnet_a_3_conv_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_3_conv_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_3_conv_1x1"
  top: "v2_inception_resnet_a_3_conv_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_3_elt"
  type: "Eltwise"
  bottom: "v2_inception_resnet_a_2_elt"
  bottom: "v2_inception_resnet_a_3_conv_1x1_bn"
  top: "v2_inception_resnet_a_3_elt"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "v2_inception_resnet_a_3_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_3_elt"
  top: "v2_inception_resnet_a_3_elt"
}
layer {
  name: "v2_inception_resnet_a_4_path1_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_3_elt"
  top: "v2_inception_resnet_a_4_path1_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_4_path1_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_4_path1_1x1"
  top: "v2_inception_resnet_a_4_path1_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_4_path1_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_4_path1_1x1_bn"
  top: "v2_inception_resnet_a_4_path1_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_4_path1_3x3_1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_4_path1_1x1_bn"
  top: "v2_inception_resnet_a_4_path1_3x3_1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_4_path1_3x3_1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_4_path1_3x3_1"
  top: "v2_inception_resnet_a_4_path1_3x3_1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_4_path1_3x3_1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_4_path1_3x3_1_bn"
  top: "v2_inception_resnet_a_4_path1_3x3_1_bn"
}
layer {
  name: "v2_inception_resnet_a_4_path1_3x3_2"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_4_path1_3x3_1_bn"
  top: "v2_inception_resnet_a_4_path1_3x3_2"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_4_path1_3x3_2_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_4_path1_3x3_2"
  top: "v2_inception_resnet_a_4_path1_3x3_2_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_4_path1_3x3_2_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_4_path1_3x3_2_bn"
  top: "v2_inception_resnet_a_4_path1_3x3_2_bn"
}
layer {
  name: "v2_inception_resnet_a_4_path2_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_3_elt"
  top: "v2_inception_resnet_a_4_path2_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_4_path2_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_4_path2_1x1"
  top: "v2_inception_resnet_a_4_path2_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_4_path2_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_4_path2_1x1_bn"
  top: "v2_inception_resnet_a_4_path2_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_4_path2_3x3"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_4_path2_1x1_bn"
  top: "v2_inception_resnet_a_4_path2_3x3"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_4_path2_3x3_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_4_path2_3x3"
  top: "v2_inception_resnet_a_4_path2_3x3_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_4_path2_3x3_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_4_path2_3x3_bn"
  top: "v2_inception_resnet_a_4_path2_3x3_bn"
}
layer {
  name: "v2_inception_resnet_a_4_path3_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_3_elt"
  top: "v2_inception_resnet_a_4_path3_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_4_path3_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_4_path3_1x1"
  top: "v2_inception_resnet_a_4_path3_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_4_path3_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_4_path3_1x1_bn"
  top: "v2_inception_resnet_a_4_path3_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_4_concat"
  type: "Concat"
  bottom: "v2_inception_resnet_a_4_path1_3x3_2_bn"
  bottom: "v2_inception_resnet_a_4_path2_3x3_bn"
  bottom: "v2_inception_resnet_a_4_path3_1x1_bn"
  top: "v2_inception_resnet_a_4_concat"
}
layer {
  name: "v2_inception_resnet_a_4_conv_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_4_concat"
  top: "v2_inception_resnet_a_4_conv_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_4_conv_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_4_conv_1x1"
  top: "v2_inception_resnet_a_4_conv_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_4_elt"
  type: "Eltwise"
  bottom: "v2_inception_resnet_a_3_elt"
  bottom: "v2_inception_resnet_a_4_conv_1x1_bn"
  top: "v2_inception_resnet_a_4_elt"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: 0.3
  }
}
layer {
  name: "v2_inception_resnet_a_4_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_4_elt"
  top: "v2_inception_resnet_a_4_elt"
}
layer {
  name: "v2_inception_resnet_a_5_path1_1x1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_4_elt"
  top: "v2_inception_resnet_a_5_path1_1x1"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "v2_inception_resnet_a_5_path1_1x1_bn"
  type: "BN"
  bottom: "v2_inception_resnet_a_5_path1_1x1"
  top: "v2_inception_resnet_a_5_path1_1x1_bn"
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    name: "lxx_label"
  }
  param {
    name: "lxx_label"
  }
  bn_param {
    frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "v2_inception_resnet_a_5_path1_1x1_relu"
  type: "ReLU"
  bottom: "v2_inception_resnet_a_5_path1_1x1_bn"
  top: "v2_inception_resnet_a_5_path1_1x1_bn"
}
layer {
  name: "v2_inception_resnet_a_5_path1_3x3_1"
  type: "Convolution"
  bottom: "v2_inception_resnet_a_5_path1_1x1_bn"
